[
    {
        "title": "2001 + 5",
        "description": "A collection of six science fiction stories.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/44.jpg",
        "type": "manga",
        "status": "\n ",
        "year": "2006"
    },
    {
        "title": "'Tis Time for Torture, Princess",
        "description": "The princess who's been held captive by the Demon Lord's army is scheduled to be executed by the Demon Lord's relentless torture!",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/14.jpeg",
        "type": "manga",
        "status": "publishing",
        "year": "2019"
    },
    {
        "title": "One Piece",
        "description": "Gol D. Roger, a man referred to as the \"Pirate King,\" is set to be executed by the World Government. But just before his demise, he confirms the existence of a great treasure, One Piece, located somewhere within the vast ocean known as the Grand Line. Announcing that One Piece can be claimed by anyone worthy enough to reach it, the Pirate King is executed and the Great Age of Pirates begins.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/2.jpeg",
        "type": "manga",
        "status": "publishing",
        "year": "1997"
    },
    {
        "title": "100% Perfect Girl",
        "description": "Jay Jin is the headstrong teenage rebel, determined to prove she's serious about making art. J. Max is the tall debonair foreigner, in Korea on business, with more--much more--to his background than he lets on. On the surface, it would seem as though Jay and J. have nothing in common... until a chance encounter in a hotel lobby sparks a mysterious attraction. Will true love prove strong enough to overcome the language barrier, not to mention the thousands of miles separating two attractive people? Then there are the interventions of friends and family who think they know best... as well as a disastrous encounter with spicy chicken kebab!",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/27.jpg",
        "type": "manhwa",
        "status": "finished",
        "year": "2007"
    },
    {
        "title": "(G) Edition",
        "description": "A young girl (Kaburagi Aruto) aspiring to become a shoujo mangaka, much to her chagrin, discovers she is fated to become a renowned hentai manga artist (thanks to a time-traveling robot named G-Maru who is also her biggest fan).",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/15.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2010"
    },
    {
        "title": "24 Colors",
        "description": "Nanaka loves to paint. So when she enters high school, she gets excited at the prospect of joining the arts club. However, there are only two members--the mysterious Chihaya and the energetic Kento. They're both good-looking guys, and Chihaya shares Nanaka's love for painting! Alongside the two gorgeous guys (and Nanaka's best friend)... what will happen?",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/47.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2008"
    },
    {
        "title": "1/11",
        "description": "Andou Sora felt the limit to his talent, and quit soccer after middle school graduation. However, an encounter with Wakamiya Shiki, representative of Japan's national womans team, moved something that slept deep inside Sora's heart.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/24.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2010"
    },
    {
        "title": "10 Dance",
        "description": "Sugiki, a standard ballroom dancer, offers to teach Suzuki, a Latin American dancer, ballroom in exchange for Suzuki's teaching him in return.Their names are similar, but their personalities are complete opposites, just like their schools of dance. When these two meet, something's bound to happen!",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/26.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2012"
    },
    {
        "title": "Kingdom",
        "description": "During the Warring States period in China, Li Xin and Piao are two brother-like youngsters who dream of becoming Great Generals, despite their low status as orphaned slaves. One day, they encounter a man of nobility, who gives Piao an opportunity to undertake an important duty within the state of Qin's royal palace. Parting ways, Xin and Piao promise each other to one day become the greatest generals in the world. However, after a fierce coup d'état occurs in the palace, Xin meets with a dying Piao, whose last words spur him into action and lead him to encounter the young and soon-to-be king of Qin, Ying Zheng.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/8.jpeg",
        "type": "manga",
        "status": "publishing",
        "year": "2006"
    },
    {
        "title": "11 Eyes",
        "description": "Satsuki Kakeru lost his sister by suicide and has been living a dull life ever since then. One day, he is transported into a bizarre world \"Red Night\" along with his friend Minase Yuka and six other classmates. In order to survive and escape from Red Night, they must defeat six black knights in order to return home.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/33.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2009"
    },
    {
        "title": "17-sai Degree Celsius",
        "description": "Our main char falls with a big bang for the new beautiful transfer student Natsuki. While he keeps it in himself, he finds out that Natsuki is quite the rebel who does what she wants, she's strong enough to break his mean senpai's arm and send him to the hospital, and she's the one who just broke his bass guitar. He still follows her around and finds out that she's quite nice but tries to distance herself from others. The reason is that she's getting married as soon as she graduates. This is also the reason why no one really punishes her for doing the stuff she does in school.Still our main character falls more for her and it seems like the love is mutual?",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/42.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2013"
    },
    {
        "title": "100-nin no Eiyuu o Sodateta Saikyou Yogensha wa",
        "description": "Raising a hundred heroes and ending the war with an evil god, Eisen saved the world. Having received a great injury from protecting the heroes, he left for the Other World to recover. In that time, the heroes made use of their abilities to contribute greatly to the development of the world. Longing to meet again with the master they admired, they reported to him of their achievements in detail. Reading their letters, Eisen makes a decision to set out and pay each of them a visit as he travels the country to sightsee.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/30.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2018"
    },
    {
        "title": "Vagabond",
        "description": "Striving for enlightenment by way of the sword, Miyamoto Musashi is prepared to cut down anyone who stands in his way. Vagabond is an action-packed portrayal of the life and times of the quintessential warrior-philosopher-one of the most celebrated samurai of all time!Vagabond portrays a fictionalized account of Miyamoto Musashi's life, on a loose adaptation of Eiji Yoshikawa's novel \"Musashi\".",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/4.jpg",
        "type": "manga",
        "status": "on hiatus",
        "year": "1998"
    },
    {
        "title": "Solo Leveling",
        "description": "10 years ago, after “the Gate” that connected the real world with the monster world opened, some of the ordinary, everyday people received the power to hunt monsters within the Gate. They are known as \"Hunters\". However, not all Hunters are powerful. My name is Sung Jin-Woo, an E-rank Hunter. I'm someone who has to risk his life in the lowliest of dungeons, the \"World's Weakest\". Having no skills whatsoever to display, I barely earned the required money by fighting in low-leveled dungeons… at least until I found a hidden dungeon with the hardest difficulty within the D-rank dungeons! In the end, as I was accepting death, I suddenly received a strange power, a quest log that only I could see, a secret to leveling up that only I know about! If I trained in accordance with my quests and hunted monsters, my level would rise. Changing from the weakest Hunter to the strongest S-rank Hunter!",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/12.jpeg",
        "type": "manhwa",
        "status": "publishing",
        "year": "2018"
    },
    {
        "title": "1001 Knights",
        "description": "A tale of mystery and magic. Naito and Yuki Fuka are twin brothers with very different personalities. While Naito is elegant and good in school, Yuki is athletic and often winds up in fights. Despite this, they maintain a close relationship. When their father turns up missing, both must travel to Dubai in search of him. A mysterious peddler has other plans though, as the twins soon find themselves in the world of One Thousand and One Nights.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/32.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2012"
    },
    {
        "title": "17 Sai (KAMATA Youji)",
        "description": "This is the story of a terrible kidnapping and gang rape crime committed against a 17-old-girl, by 17-year-old boys. Why did such a thing happen? Why was no one able to prevent it?",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/41.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2004"
    },
    {
        "title": "2015 - Space Series",
        "description": "A collection of stories by various authors about the universe and beyond.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/45.jpg",
        "type": "manhwa",
        "status": "finished",
        "year": "2015"
    },
    {
        "title": "Berserk",
        "description": "Guts, a former mercenary now known as the \"Black Swordsman,\" is out for revenge. After a tumultuous childhood, he finally finds someone he respects and believes he can trust, only to have everything fall apart when this person takes away everything important to Guts for the purpose of fulfilling his own desires. Now marked for death, Guts becomes condemned to a fate in which he is relentlessly pursued by demonic beings.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/1.jpg",
        "type": "\n ",
        "status": "publishing",
        "year": "1989"
    },
    {
        "title": "1 Love 9",
        "description": "Takuma Miyabe is a boy from an island who moved to Tokyo because his island doesn't have a high school there. However, the ratio of male and female is 1:9. There are too many female students in his class, and as a result, they flirt with the still innocent Takuma.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/22.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2008"
    },
    {
        "title": "12 Kagetsu",
        "description": "In 12 months you'll be invited into the life of a group of students who discover with joy and sadness the meaning of \"Love.\"",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/35.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2002"
    },
    {
        "title": "Fullmetal Alchemist",
        "description": "Alchemists are knowledgeable and naturally talented individuals who can manipulate and modify matter due to their art. Yet despite the wide range of possibilities, alchemy is not as all-powerful as most would believe. Human transmutation is strictly forbidden, and whoever attempts it risks severe consequences. Even so, siblings Edward and Alphonse Elric decide to ignore this great taboo and bring their mother back to life. Unfortunately, not only do they fail in resurrecting her, they also pay an extremely high price for their arrogance: Edward loses his left leg and Alphonse his entire body. Furthermore, Edward also gives up his right arm in order to seal his brother's soul into a suit of armor.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/6.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2001"
    },
    {
        "title": "3, Street of Mysteries",
        "description": "3, Street of Mysteries explores the fantastical-poetic vein that has forged Mizuki's reputation in Japan. The stories contained in this series hold in common the obsessive ideas of immortality and of life after death. Skillfully blending a range of black humor, drama, and questions of morality, Mizuki shows once more his profound understanding of the human soul.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/51.jpg",
        "type": "manga",
        "status": "finished",
        "year": "1977"
    },
    {
        "title": "Shingeki no Kyojin",
        "description": "Hundreds of years ago, horrifying creatures which resembled humans appeared. These mindless, towering giants, called \"titans,\" proved to be an existential threat, as they preyed on whatever humans they could find in order to satisfy a seemingly unending appetite. Unable to effectively combat the titans, mankind was forced to barricade themselves within large walls surrounding what may very well be humanity's last safe haven in the world.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/5.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2009"
    },
    {
        "title": "29-sai Dokushin wa Isekai de Jiyuu ni Ikita......katta.",
        "description": "This is a story of a 29-years-old bachelor who was brought to a different world to live freely. Caught by an \"unwanted\" wife from day one, his life is not going so smoothly when the entire country focuses its attention on him in ten days. Without losing to such an obstacle (?), he will continue to live on.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/49.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2018"
    },
    {
        "title": "07-Ghost",
        "description": "Teased unmercifully for his past as an orphan and a slave, Teito has only his best friend Mikage to ease his days at the elite Barsburg Academy - and his mastery of the magical art of Zaiphon! But even that will not be enough to save him when he discovers a horrifying secret behind the ruling Empire. Trapped in an ancient battle between a wicked Death God and the Seven Ghosts and guided by three mysterious priests, Teito discovers a power that could save the world... and shed light on his own mysterious past.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/21.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2005"
    },
    {
        "title": "21st Century Boys",
        "description": "Growing older is pretty rough and Kenji is finding out just how hard it can be as life starts wearing down on him. On top of trying to make ends meet running a convenience store he has to care for the niece that his missing sister left in his care. Memories of youth make it easier, until those memories come back to haunt himPicking up directly after the events of 20th Century Boys, it seems like the world is finally out of danger, but the mystery of \"Friend\" still exists. As the world is threatened again, Kenji must search his memories for any clue about \"Friend\".",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/46.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2007"
    },
    {
        "title": "009 Re:Cyborg",
        "description": "The pre-anime debut manga about the new cyborg 009.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/20.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2012"
    },
    {
        "title": "12 Beast",
        "description": "Join ninja apprentice Eita Touga as he embarks on an epic adventure searching for his missing brother Kouki and save the Autana (Humanoid Beast) race of \"Live-Earth\" from the mysterious Gigas seeking to exterminate them.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/34.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2013"
    },
    {
        "title": "1/2 Prince",
        "description": "It is the year 2100 A.D., and humans have developed a virtual reality game with a realism level of 99%. Feng Lan, due to a bet with her twin brother, vows to succeed in playing the game without using her \"female benefits.\" Due to this, she becomes the first and only female to play as a male character in \"Second Life.\" As her infamy rises as a bloodthirsty warrior, can she keep her identity a secret from her real life acquaintances whom she has beaten up?",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/25.jpg",
        "type": "manhua",
        "status": "finished",
        "year": "2006"
    },
    {
        "title": "+ Tic Neesan",
        "description": "The story follows a third-year high-school girl (Nee-san) who likes building plastic models in a model-making club along with fellow club members Makimaki and Okappa.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/16.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2009"
    },
    {
        "title": "Grand Blue",
        "description": "A new life begins for Kitahara Iori as he begins his college career near the ocean in Izu city, full of excitement for his new life. He will be moving into his Uncle's diving store \"Grand Blue.\" There he finds the beautiful ocean, beautiful women, and men that love diving and alcohol. Will Iori be able to live his dream college life?",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/10.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2014"
    },
    {
        "title": "1000 Yen Hero",
        "description": "Kaijin are attacking! But luckily for the people of Japan, heroes are there to protect them, with powers that run on a rate of yen per second. For Hiasa Sen however, there are much more important things to worry about, like catching sales on groceries, and his many part time jobs, all to take care of his little sister. When danger approaches however, he has a secret power of his own, but it may be more trouble than it's worth.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/31.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2017"
    },
    {
        "title": "μ & I",
        "description": "After the meteorite \"Artemis\" collapses on the moon, an unidentified phenomenon affects humans: the \"Reproductive system disease\". 12 years passed and mankind has done research in the field of cloning and immortality in this world where the birth rate is 0. Meanwhile, Ashiro Koshiro is still seeking the cause of this disease, and suddenly a woman appears and gives him a mysterious suitcase...",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/13.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2014"
    },
    {
        "title": "100-man no Inochi no Ue ni Ore wa Tatteiru",
        "description": "Yotsuya Yuusuke along with his classmates Shindou Iu and Hakozaki Kusue have been transported to a strange and unknown world inhabited by mythological creatures. As soon as they arrive, they meet somebody calling himself the Game Master who then grants them a time-limited quest. To aid them in this quest, he also bestows Shindou and Hakozaki with the roles of a Magician and a Warrior while Yotsuya is randomly granted the role of... a Farmer?!",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/28.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2016"
    },
    {
        "title": "+Anima",
        "description": "Beings who possess animal-like powers walk among humans in this alternate universe. These mysterious mutants, the +Anima, are shunned by society. Four outcasts in particular—Cooro, a boy with crow-like powers; Husky, a fish-boy; Senri, a bear +Anima; and a girl named Nana, who wields the power of the bat—search for others like themselves while trying to gain acceptance in a world cruel to anyone or anything that is different.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/17.jpg",
        "type": "manga",
        "status": "finished",
        "year": "1999"
    },
    {
        "title": "13 Club",
        "description": "If you could find out a little something about the future, what would you do? Get rich off of the stock market? Use the media to become famous as a prophet? Or...",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/36.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2008"
    },
    {
        "title": "20th Century Boys",
        "description": "As the 20th century approaches its end, people all over the world are anxious that the world is changing. And probably not for the better.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/11.jpg",
        "type": "manga",
        "status": "finished",
        "year": "1999"
    },
    {
        "title": "14-sai no Koi",
        "description": "A story about two unusually mature young people. They are both smart, very together and they are in love. But, as grown-up as they act, they are still just 14 and their feelings for each other are captured with tenderness and lack of nostalgia, but very cutely.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/38.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2010"
    },
    {
        "title": "100-man Volt no Kanojo",
        "description": "Narugami Kyoko is a 14-year-old girl with extraordinarily high amounts of static electricity. She shorts out electronics, shocks people, frizzes out people's hair, and makes their clothes full of static. Understandably, most people at school avoid her, except for her friend Hikari. This 4-koma style manga features her humorous everyday school life as she hangs out with Hikari, interacts with teachers, and tries to become closer to her other classmates despite her electricity problem!",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/29.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2011"
    },
    {
        "title": "+C: Sword and Cornett",
        "description": "There was once a hero who vanquished the darkness of the land and liberated the people. He then built a kingdom, and had his descendants rule as kings. Although they had ruled the land for so many years, in reality, political power was being wielded solely by the aristocrats of each region.One day, this seemingly peaceful kingdom was disturbed by the mysterious death of the principal heir to the throne. The sequence of events that this assassination set into motion, would soon come to involve all of those with the right to become the next king...",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/18.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2008"
    },
    {
        "title": "3 am Dangerous Zone",
        "description": "Momoko, who dreams of becoming an illustrator, finds employment in an ultra fast-paced office that specializes in designing pachinko parlors!! With the office running a yakuza-like business and employing a designer who has a habit of suddenly stripping in the middle of the night, Momoko believes that the company employees are a bit... no, definitely eccentric!! She continues pulling all-nighters, unable even to return home... And in the midst of that cigarette smoke-filled office, where women's authority takes a step back, she asks herself, \"Why am I here?\"",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/50.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2008"
    },
    {
        "title": "1-nen A-gumi no Monster",
        "description": "A Private Girls' High is a special school nurturing young maidens to be graceful, delicate intellectuals.However Class 1-A, infamously known as the \"Class of Monsters,\" is full of bullies, blackmailers, scheming sadists, and other trouble makers.Within a week, every teacher who has taught this class has either quit, resigned, or even been imprisoned.The plain-looking Jimi Tarou shall carve out his name and become a legendary teacher.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/23.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2018"
    },
    {
        "title": "17-sai, Kiss to Dilemma",
        "description": "At 17 years old, I didn't know anything about life or love. And I didn't see my cousin as a \"man\"... I dont want to know anything, but love changed everything...",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/43.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2013"
    },
    {
        "title": "Monster",
        "description": "Kenzou Tenma, a renowned Japanese neurosurgeon working in post-war Germany, faces a difficult choice: to operate on Johan Liebert, an orphan boy on the verge of death, or on the mayor of Düsseldorf. In the end, Tenma decides to gamble his reputation by saving Johan, effectively leaving the mayor for dead.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/3.jpg",
        "type": "manga",
        "status": "finished",
        "year": "1994"
    },
    {
        "title": "15: Meisetsu Kougyou Koukou Rugby Bu",
        "description": "Ever since he was little, Akira wanted to be a rugby player. But since he lived on a tiny island with no other children, it was very difficult for him to learn how to play. In hopes of becoming useful to a rugby team, he practiced the one thing he could do by himself, kicking. Now Akira is heading to high school, and he's going to try to make his dreams of playing rugby and having friends come true!",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/39.jpg",
        "type": "manga",
        "status": "publishing",
        "year": "2010"
    },
    {
        "title": "Slam Dunk",
        "description": "Hanamichi Sakuragi, a tall, boisterous teenager with flame-red hair and physical strength beyond his years, is eager to put an end to his rejection streak of 50 and finally score a girlfriend as he begins his first year of Shohoku High. However, his reputation for delinquency and destructiveness precedes him, and most of his fellow students subsequently avoid him like the plague. As his first day of school ends, he is left with two strong thoughts: \"I hate basketball\" and \"I need a girlfriend.\"",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/9.jpg",
        "type": "manga",
        "status": "finished",
        "year": "1990"
    },
    {
        "title": "29 to JK",
        "description": "Yariba Eiji (29 years old with intimidating eyes), a corporate slave whose only hobbies are video games and manga, gets through life by spending his time off relaxing at net cafes. One day, he happens upon Minamisato Karen (a 15 year old high school girl) and ends up scolding her. This leads to her warming up to the 29 year old Eiji...! Not only that, Eiji's little sister (a lazy middle schooler), childhood friend (a nosy ex-girlfriend), and his subordinate (a cool and serious girl) are also becoming interested in him. Love is coming at him from every direction! Juggling between his work and his newly developed ventures into romance, will Eiji's peaceful days ever return? From the creator of Oreshura, the forbidden age gap love comedy finally gets a manga adaptation!",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/48.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2017"
    },
    {
        "title": "14-Sai",
        "description": "A SF/horror manga that takes place in 2200. At a chicken manufacturing company, a certain chicken transforms into a supermutant named Chicken George. And so, a nightmarish journey through a twisted version of the future unfolds.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/37.jpg",
        "type": "manga",
        "status": "finished",
        "year": "1990"
    },
    {
        "title": "16 Life",
        "description": "Saya is an ordinary, lethargic female high school student. While she was alone at karaoke, singing enthusiastically a song of her favorite artist, Takase Kazuki, the person himself was watching her...?!",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/40.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2010"
    },
    {
        "title": "Oyasumi Punpun",
        "description": "Punpun Onodera is a normal 11-year-old boy living in Japan. Hopelessly idealistic and romantic, Punpun begins to see his life take a subtle—though nonetheless startling—turn to the adult when he meets the new girl in his class, Aiko Tanaka. It is then that the quiet boy learns just how fickle maintaining a relationship can be, and the surmounting difficulties of transitioning from a naïve boyhood to a convoluted adulthood. When his father assaults his mother one night, Punpun realizes another thing: those whom he looked up to were not as impressive as he once thought.",
        "cover_img": "https://cdn.readdetectiveconan.com/file/mangapill/i/7.jpg",
        "type": "manga",
        "status": "finished",
        "year": "2007"
    }
]